load_test_scripts/api-gtw-test.yml
config:
  target: "http://localhost:19030"
  phases:
    - duration: 60
      arrivalCount: 1000
      maxVusers: 60
      name: Warm up

scenarios:
  - name: "Login"
    flow:
      - post:
          url: "/auth/ms1/google/"
          json:
            profileObj: {"googleId": "111163958196518887017",
                          imageUrl:"https://lh3.googleusercontent.com/a/AATXAJzD651TM-vGg_8ksr_kd7O731vNR43LCknpkRyB=s96-c",
                          email:"pramod.bhakta@somaiya.edu",
                          name:"Pramod",
                          givenName:"Pramod"
                        }