load_test_scripts/sample.yml
config:
  target: "http://localhost:19030"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 1000
      name: Ramp up load
    - duration: 300
      arrivalRate: 500
      rampTo: 10000
      name: Sustained load
  payload:
    path: "test.csv"
    fields:
      - "date"

scenarios:
  - name: "Get radars"
    flow:
      - post:
          url: "/radars"
          json:
            date: "{{ date }}"
      - think: 3